samples/issue.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="EK-4bdc7c92-e9e9-437a-b12f-b1e57c022fae"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=equidadtes</ds:X509IssuerName><ds:X509SerialNumber>662525258</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>kWqxVivlxK7WVQQySdU2wvDSF+OmK3Pb3mTGPTBI2Fxcgmb4Bju/C4gIo6NdVjO3dIpgXBJt376p&#xd;
qlGv9uM8/40fZ1HB0L2EYvDrp6SzdJWLYaNLAFA3T8DlvhKGxPiBRUipeC4haPGwRESz5L6NX7R+&#xd;
ZFx6mKfFssmKbIaDPE8mCp3UPXJKvCrxi1X9edFMEyC3gpVObLSUsyMk6qjb6df0IxYnHgU1m7mr&#xd;
m2TPjTuC6vDlHk9tSVIiClpGQ7WruZf5fXMia/a6phj0EWPT0zMxPZ9tUxtvjdoZT1QJQeFbnj8l&#xd;
ZIUWUhvNBJkzh1/OyuuJRtww3XxSPOctK6Tw3w==</xenc:CipherValue></xenc:CipherData><xenc:ReferenceList><xenc:DataReference URI="#ED-e0eda12c-7940-464e-ba26-af355a2da170"/></xenc:ReferenceList></xenc:EncryptedKey><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="X509-c045d1ed-df70-4dbf-9fa9-fa0ad6980484">MIICyTCCAbGgAwIBAgIEJ31VSjANBgkqhkiG9w0BAQsFADAVMRMwEQYDVQQDEwplcXVpZGFkdGVz&#xd;
MB4XDTIyMDYyMzE2MTY1OVoXDTIzMDYyMzE2MTY1OVowFTETMBEGA1UEAxMKZXF1aWRhZHRlczCC&#xd;
ASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBALefDaGZ7rNRFKoFph42+O6f5y6/X8p5PCqV&#xd;
F91zMs2S4Zw3QkMbglAw6IQ1a5wurob9gOcUJxyUL7rgk8QxAJKBsmnZtihsL1LXOodUB06DYSm7&#xd;
YbU6Kr8t/zq2E2MvR1J9RxaZroGjuj9peobxxgWPudMJS7fv+s4tSGPbrRWdFZErKNrZExByuuWx&#xd;
mvE3UDJW1dCt+y++tHS3uixWBwmiBHTjp0rxYFkEhFtZiIHXSFqO27R9GVF0k5UB3+JPZjFZSuoH&#xd;
Cr3BDySeZtX3d7TIfx117uAMF/m6lWFyEZRLGEGc4LI+ggs/ckPQ1Nb/kpkhMi9lfEieGi2OZo/a&#xd;
q/cCAwEAAaMhMB8wHQYDVR0OBBYEFKMQCFZmYnPqG2N6xa8Ly7lHYsEKMA0GCSqGSIb3DQEBCwUA&#xd;
A4IBAQCf0JXSq7ULOSY+/YN+uAPWEyJA9JP/0cGtsFN5bakLc8eH8/0uZsprU/FbN8iGIDGJha0W&#xd;
iJgpR7MpDpvBy9NBEfg7Xea1jTmlEtikvBKCCU+8Bs3wcPTMQFrBbjTgfsSuDk6NEYcwLhTWzlTL&#xd;
48hh/eAwP6VHMPNHSOyRRDGMfPE9kC0ZgMRpCbWhiuLdwbWL2zBkDGU+BMc8oB/nBjuFFTnBCpuF&#xd;
AT6abRnSBwRT66gneQYxAaSVWWey73p116aayVSxCz0fbKvOqvtNorvLWGLntTiNk7lk5bTGjsR0&#xd;
lpM6G5hZwsnFqr6U3DWpPK8TmYpiCpbP6G2LPH12qCMZ</wsse:BinarySecurityToken><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-06682a54-8aff-4403-b8b9-176629cb78f8"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#TS-2d34d613-db53-4c8d-ada0-8f482ff1f5ff"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="wsse soap"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>IXpWWHlQwwM7nYwBqF0CLntzCvM=</ds:DigestValue></ds:Reference><ds:Reference URI="#id-90ed690a-6f75-436a-a0b5-ff263aade749"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>ve9WFxjadw22DpicOw8XgUt7f5Q=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>qhiH4C8tDgZeznyNTqH2W8HSTOMvywb7w6tRSQyGbbs3A+a5m6/+1i2pdyLkn7ZadE4YsQ/TMXn0&#xd;
Ai1G0fNZC4Zbw2LmUnhLPd3aVUfMjf0jzWtTmc8SvOUTZCwzsrkr8g5o9TPJKZq8rd8CMV1cVy44&#xd;
9cxT7oC9YLcu1tBliDS4Uk/2pRLjXYiHEEFKmdbmn3rHkrq9lPRLzJX+8Uw262/d2jx+Mp7aw3l1&#xd;
17NjgMZQltrrjAMeqSOXUGl05GldiBcvYszp8YNhTU2+saiFWg9lZvkFeISl+20QrOO2ANLnFoBO&#xd;
CwyddvBqtaxGPHeRmGiNEO/LdMGl0uEO/1ws3g==</ds:SignatureValue><ds:KeyInfo Id="KI-fb5f329b-922f-4483-9336-5202cc4daf30"><wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="STR-3902dc96-fa42-4845-ac1d-4bfd685f0c65"><wsse:Reference URI="#X509-c045d1ed-df70-4dbf-9fa9-fa0ad6980484" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature><wsu:Timestamp wsu:Id="TS-2d34d613-db53-4c8d-ada0-8f482ff1f5ff"><wsu:Created>2022-10-01T06:59:13.055Z</wsu:Created><wsu:Expires>2022-10-01T07:04:13.055Z</wsu:Expires></wsu:Timestamp></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-90ed690a-6f75-436a-a0b5-ff263aade749"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="ED-e0eda12c-7940-464e-ba26-af355a2da170" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd" wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey"><wsse:Reference URI="#EK-4bdc7c92-e9e9-437a-b12f-b1e57c022fae"/></wsse:SecurityTokenReference></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>gafr8lA2Vc+kiIEI4SBOvVF0xAqpZBJdZnslYCSQ7EoOkJS/1dI4CdULZFbtrdNeFD0OCptv2lcE&#xd;
wnSZPkZwwULl79lKDUm8AbbA6bzWdmskEUjkbkaDeAM77zP3r0tB4iExh1/zbSjCZc7IH5sRBf+e&#xd;
cyPmn25Rnvo/070B0C8ZZ5rjwj647ZhdaZlgUFnDL7opVzUKq5mjf9vczD9vkQi9KDvpiIWrFu5F&#xd;
ng4Z5R485buxDYl1/BWDrvKik693q+7tvIh+IGw/xuG3ffCkohVO/HyyyGyHOOobT9kWDhydMp5N&#xd;
R0+hMoN4KWDdz9gsjBr13NC4NOUP7GFC/QemU0621GIrAv6lB++x2TubUYm0JL1rDF+E6a9zm0Ce&#xd;
u8baNSffGjtbTTUgjDrw4dJzXvGeq+mvQroOUDWJpDU3cajQcYrGGvKFa6cBF6gdKvVkADKxACg/&#xd;
eooB2Ce7c06WyS3pfBmwK8+QyG+CJpcAj2hNE9UxxydFRbFK/xWDVYxicLx0cW4JOt+vKr2+C0EK&#xd;
S/64bPDm2/PGF/9kkf3CFkUTHEN0uWq77UArJQeL/So3otuOOg94G9ygVq71I74yWmpCrUTk7TLz&#xd;
lm+fRrDzPENlG6DeXwgBUCn1IF6R/KnTTvAqSaqokBnWcVjgLG5tXPXeXfkImEJd06U7IleDl4sW&#xd;
FRtKNBWPouJUdiWVvEF+</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></soap:Body></soap:Envelope>